Autodesk.Revit.DB.LayerModifier.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.LayerModifier.Separator
The separator string that will follow this modifier in the export layer name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.LayerModifier.ModifierType
The modifier type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.LayerModifier.#ctor(Autodesk.Revit.DB.ModifierType,System.String)
Constructs a new LayerModifier with modifierType and separator.
modifierType:
The modifier type.
separator:
The separator string that will follow this modifier in the export layer name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The provided separator contains invalid characters (most special characters are invalid).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.LayerModifier.#ctor
Constructs a new LayerModifier with default values.
Since:
2014

Autodesk.Revit.DB.LayerModifier
A modifier used to designate extra strings to appear in the exported layer name.
Remarks:
A modifier consists of a type (from Autodesk.Revit.DB.ModifierType and an optional separator.
Apply a modifier to one or more Autodesk.Revit.DB.ExportLayerInfo objects to modify the layer name that
will be assigned when a Revit object is exported.
Since:
2014